renesas/rx-driver-package/source/r_qspi_smstr_rx/r_qspi_smstr_rx_vx.xx/r_qspi_smstr_rx/src/targets/rx72m/r_qspi_smstr_target_dev_port.c
/*******************************************************************************
* Function Name: r_qspi_smstr_module_enable
* Description  : Releases module stop state.
* Arguments    : channel -
*                    Which channel to use
* Return Value : none
*******************************************************************************/
void r_qspi_smstr_module_enable(uint8_t channel)
{
#if defined(QSPI_SMSTR_CFG_CH0_INCLUDED)
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    bsp_int_ctrl_t int_ctrl;
#endif
#endif
    /* Enable writing to registers. */
#ifdef QSPI_SMSTR_CFG_USE_FIT
    R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);
#else
    QSPI_PRCR = QSPI_PRCR_ENABLE;
    if (QSPI_PRCR_ENABLE == QSPI_PRCR)
    {
        /* Wait for the write completion. */
        R_BSP_NOP();
    }
#endif /* QSPI_SMSTR_CFG_USE_FIT */
    
    switch (channel)
    {
        case 0:
#if defined(QSPI_SMSTR_CFG_CH0_INCLUDED)
        #if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
            R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_DISABLE, &int_ctrl);
        #endif
            MSTP(QSPI) = 0;
        #if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
            R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_ENABLE, &int_ctrl);
        #endif
            if (0 == MSTP(QSPI))
            {
                /* Wait for the write completion. */
                R_BSP_NOP();
            }
#endif
        break;
        
        default:
            /* Should never get here. Valid channel number is checked above. */
        break;
    }
    
    /* Disable writing to registers. */
#ifdef QSPI_SMSTR_CFG_USE_FIT
    R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_LPC_CGC_SWR);
#else
    QSPI_PRCR = QSPI_PRCR_DISABLE;
    if (QSPI_PRCR_DISABLE == QSPI_PRCR)
    {
        /* Wait for the write completion. */
        R_BSP_NOP();
    }
#endif /* QSPI_SMSTR_CFG_USE_FIT */
}


/*******************************************************************************
* Function Name: r_qspi_smstr_module_disable
* Description  : Sets the Module Stop of QSPI.
* Arguments    : channel -
*                    Which channel to use
* Return Value : none
*******************************************************************************/
void r_qspi_smstr_module_disable(uint8_t channel)
{
#if defined(QSPI_SMSTR_CFG_CH0_INCLUDED)
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    bsp_int_ctrl_t int_ctrl;
#endif
#endif
    /* Enable writing to registers. */
    QSPI_PRCR = QSPI_PRCR_ENABLE;
    if (QSPI_PRCR_ENABLE == QSPI_PRCR)
    {
        /* Wait for the write completion. */
        R_BSP_NOP();
    }
    
    switch (channel)
    {
        case 0:
#if defined(QSPI_SMSTR_CFG_CH0_INCLUDED)
        #if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
            R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_DISABLE, &int_ctrl);
        #endif
            MSTP(QSPI) = 1;
        #if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
            R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_ENABLE, &int_ctrl);
        #endif
            if (1 == MSTP(QSPI))
            {
                /* Wait for the write completion. */
                R_BSP_NOP();
            }
#endif
        break;
        
        default:
            /* Should never get here. Valid channel number is checked above. */
        break;
    }
    
    /* Disable writing to registers. */
    QSPI_PRCR = QSPI_PRCR_DISABLE;
    if (QSPI_PRCR_DISABLE == QSPI_PRCR)
    {
        /* Wait for the write completion. */
        R_BSP_NOP();
    }
}


/*******************************************************************************
* Function Name: r_qspi_smstr_tx_dmacdtc_wait
* Description  : Waits for transmission completion.
* Arguments    : channel -
*                    Which channel to use
*                size -
*                    Size of data
* Return Value : QSPI_SMSTR_SUCCESS -
*                    Successful operation
*                QSPI_SMSTR_ERR_HARD -
*                    Hardware error
*******************************************************************************/
qspi_smstr_status_t r_qspi_smstr_tx_dmacdtc_wait(uint8_t channel, uint32_t size)
{
    qspi_smstr_status_t    ret  = QSPI_SMSTR_SUCCESS;
    uint32_t               time = QSPI_TIMER_MIN_TIME;     /* 100ms        */

    /* ---- Check DMAC/DTC transfer end.  --- */
    /* Timeout value depends on transfer size. 
       Minimum time is 100ms. When the data count exceeds 10 sectors (1 sector = 512 bytes),
       increase 10ms time for 1 sector increase.*/
    if ((QSPI_SECTOR_SIZE * 11) <= size)
    {
        time = (time + (((size / QSPI_SECTOR_SIZE) - 10) * 10));
        if (0x0fffffff < time)
        {
            time = 0x0fffffff;
        }
    }

    /* Start timer. */
    r_qspi_smstr_start_timer(channel, time);

    /* WAIT_LOOP */
    while (1)
    {
        /* Check timeout. */
        if (QSPI_SMSTR_ERR_HARD == r_qspi_smstr_check_timer(channel))
        {
            R_QSPI_SMSTR_LOG_FUNC(QSPI_SMSTR_DEBUG_ERR_ID, (uint32_t)QSPI_SMSTR_TARGET_DEV_PORT, __LINE__);
            ret = QSPI_SMSTR_ERR_HARD;
            break;
        }
        
        /* Check DMAC/DTC transfer end */
        if (QSPI_SET_TRANS_STOP == gs_qspi_int_spti_dmacdtc_flg[channel])
        {
            break;
        }
    }

    r_qspi_smstr_end_timer(channel);

    return ret;
}


/*******************************************************************************
* Function Name: r_qspi_smstr_rx_dmacdtc_wait
* Description  : Waits for reception completion.
* Arguments    : channel -
*                    Which channel to use
*                size -
*                    Size of data
* Return Value : QSPI_SMSTR_SUCCESS -
*                    Successful operation
*                QSPI_SMSTR_ERR_HARD -
*                    Hardware error
*******************************************************************************/
qspi_smstr_status_t r_qspi_smstr_rx_dmacdtc_wait(uint8_t channel, uint32_t size)
{
    qspi_smstr_status_t    ret  = QSPI_SMSTR_SUCCESS;
    uint32_t               time = QSPI_TIMER_MIN_TIME;     /* 100ms        */

